expense_apps/employee/test/Performance/ExpenseSubmission/Reports/LoadTestReport/statistics.json
{
  "Submits Expense With Date" : {
    "transaction" : "Submits Expense With Date",
    "sampleCount" : 457,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 23.002188183807448,
    "medianResTime" : 20.0,
    "minResTime" : 10.0,
    "maxResTime" : 300.0,
    "pct1ResTime" : 28.0,
    "pct2ResTime" : 45.0,
    "pct3ResTime" : 109.70000000000056,
    "throughput" : 2.1833539565526894,
    "receivedKBytesPerSec" : 0.720467427954097,
    "sentKBytesPerSec" : 1.509584571522758
  },
  "Employee submits invalid description" : {
    "transaction" : "Employee submits invalid description",
    "sampleCount" : 55,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 12.945454545454544,
    "medianResTime" : 8.0,
    "minResTime" : 3.0,
    "maxResTime" : 151.0,
    "pct1ResTime" : 15.799999999999997,
    "pct2ResTime" : 49.399999999999714,
    "pct3ResTime" : 151.0,
    "throughput" : 0.2989926665253247,
    "receivedKBytesPerSec" : 0.061316855439763854,
    "sentKBytesPerSec" : 0.19183416201868977
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1114,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 21.74416517055657,
    "medianResTime" : 19.0,
    "minResTime" : 3.0,
    "maxResTime" : 300.0,
    "pct1ResTime" : 32.0,
    "pct2ResTime" : 45.0,
    "pct3ResTime" : 110.64999999999918,
    "throughput" : 5.003031459816316,
    "receivedKBytesPerSec" : 1.6861793501448366,
    "sentKBytesPerSec" : 3.2799719800485034
  },
  "Employee Logs In" : {
    "transaction" : "Employee Logs In",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 12.200000000000003,
    "medianResTime" : 8.0,
    "minResTime" : 4.0,
    "maxResTime" : 92.0,
    "pct1ResTime" : 16.80000000000001,
    "pct2ResTime" : 38.799999999999955,
    "pct3ResTime" : 91.99,
    "throughput" : 1.6711509216397331,
    "receivedKBytesPerSec" : 0.9171746269155567,
    "sentKBytesPerSec" : 0.7392884448269523
  },
  "Employee submits negative expense" : {
    "transaction" : "Employee submits negative expense",
    "sampleCount" : 60,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 10.46666666666667,
    "medianResTime" : 8.0,
    "minResTime" : 3.0,
    "maxResTime" : 65.0,
    "pct1ResTime" : 14.0,
    "pct2ResTime" : 44.04999999999992,
    "pct3ResTime" : 65.0,
    "throughput" : 0.3410524879778998,
    "receivedKBytesPerSec" : 0.07194075918283824,
    "sentKBytesPerSec" : 0.22015204546229666
  },
  "Submits Expense Without Date" : {
    "transaction" : "Submits Expense Without Date",
    "sampleCount" : 442,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 25.228506787330314,
    "medianResTime" : 20.0,
    "minResTime" : 9.0,
    "maxResTime" : 295.0,
    "pct1ResTime" : 39.0,
    "pct2ResTime" : 52.5499999999999,
    "pct3ResTime" : 127.5499999999999,
    "throughput" : 2.0041897541466778,
    "receivedKBytesPerSec" : 0.6612602264122283,
    "sentKBytesPerSec" : 1.3426505579537313
  }
}