expense_apps/employee/test/Performance/ExpenseSubmission/Reports/StressTestReport/statistics.json
{
  "Submits Expense With Date" : {
    "transaction" : "Submits Expense With Date",
    "sampleCount" : 27370,
    "errorCount" : 6153,
    "errorPct" : 22.480818,
    "meanResTime" : 2512.5382900986187,
    "medianResTime" : 541.0,
    "minResTime" : 2.0,
    "maxResTime" : 15974.0,
    "pct1ResTime" : 6722.0,
    "pct2ResTime" : 6875.0,
    "pct3ResTime" : 8351.970000000005,
    "throughput" : 19.492080674567003,
    "receivedKBytesPerSec" : 6.370049253201202,
    "sentKBytesPerSec" : 13.39570065466186
  },
  "Employee submits invalid description" : {
    "transaction" : "Employee submits invalid description",
    "sampleCount" : 3068,
    "errorCount" : 18,
    "errorPct" : 0.58670145,
    "meanResTime" : 87.79563233376786,
    "medianResTime" : 26.0,
    "minResTime" : 3.0,
    "maxResTime" : 5802.0,
    "pct1ResTime" : 114.0,
    "pct2ResTime" : 179.54999999999973,
    "pct3ResTime" : 1932.8199999999879,
    "throughput" : 2.2320048248552795,
    "receivedKBytesPerSec" : 0.489296853004149,
    "sentKBytesPerSec" : 1.4236558795830487
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 61929,
    "errorCount" : 12230,
    "errorPct" : 19.74842,
    "meanResTime" : 2218.5316249253287,
    "medianResTime" : 46.0,
    "minResTime" : 2.0,
    "maxResTime" : 15974.0,
    "pct1ResTime" : 2527.0,
    "pct2ResTime" : 4992.750000000004,
    "pct3ResTime" : 6716.990000000002,
    "throughput" : 44.01060876758356,
    "receivedKBytesPerSec" : 13.99610636980879,
    "sentKBytesPerSec" : 29.488907904288705
  },
  "Employee Logs In" : {
    "transaction" : "Employee Logs In",
    "sampleCount" : 900,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 24.85555555555554,
    "medianResTime" : 11.0,
    "minResTime" : 3.0,
    "maxResTime" : 295.0,
    "pct1ResTime" : 61.0,
    "pct2ResTime" : 86.0,
    "pct3ResTime" : 160.99,
    "throughput" : 4.0586062746053,
    "receivedKBytesPerSec" : 2.227477271804862,
    "sentKBytesPerSec" : 1.7954576585900401
  },
  "Employee submits negative expense" : {
    "transaction" : "Employee submits negative expense",
    "sampleCount" : 3022,
    "errorCount" : 8,
    "errorPct" : 0.26472536,
    "meanResTime" : 85.08636664460614,
    "medianResTime" : 25.0,
    "minResTime" : 3.0,
    "maxResTime" : 5527.0,
    "pct1ResTime" : 113.0,
    "pct2ResTime" : 184.8499999999999,
    "pct3ResTime" : 1832.699999999998,
    "throughput" : 2.193071577444019,
    "receivedKBytesPerSec" : 0.47655946112269004,
    "sentKBytesPerSec" : 1.411897265899406
  },
  "Submits Expense Without Date" : {
    "transaction" : "Submits Expense Without Date",
    "sampleCount" : 27569,
    "errorCount" : 6051,
    "errorPct" : 21.948565,
    "meanResTime" : 2469.2376945119427,
    "medianResTime" : 513.0,
    "minResTime" : 2.0,
    "maxResTime" : 13006.0,
    "pct1ResTime" : 6726.0,
    "pct2ResTime" : 6868.0,
    "pct3ResTime" : 8415.990000000002,
    "throughput" : 19.654658615355,
    "receivedKBytesPerSec" : 6.364069562423806,
    "sentKBytesPerSec" : 13.10690755175843
  }
}